Revit 2024 API
RailingType.BalusterPlacement Property
 Accesses the object containing properties related to the baluster placement.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public BalusterPlacement BalusterPlacement { get; }
Visual Basic
Public ReadOnly Property BalusterPlacement As BalusterPlacement
	Get
Visual C++
public:
property BalusterPlacement^ BalusterPlacement {
	BalusterPlacement^ get ();
}
See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace